;--------------------------------------------------
;---------------- Upgrade Templates ---------------
;--------------------------------------------------
[FreeFireUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="微力扳机"
FriendlyNamePlural="微力扳机"
BriefSummary="当射击MISS时士兵有15%几率触发第二次射击。"
TinySummary="当射击MISS时士兵有15%几率触发第二次射击"
LootTooltip="安装此武器插件后，当射击MISS时士兵有15%几率触发第二次射击."

[FreeFireUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级微力扳机"
FriendlyNamePlural="高级微力扳机"
BriefSummary="当射击MISS时士兵有30%几率触发第二次射击。"
TinySummary="当射击MISS时士兵有30%几率触发第二次射击"
LootTooltip="安装此武器插件后，当射击MISS时士兵有50%几率触发第二次射击."

[FreeFireUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极微力扳机"
FriendlyNamePlural="终极微力扳机"
BriefSummary="当射击MISS时士兵有45%几率触发第二次射击。"
TinySummary="当射击MISS时士兵有45%几率触发第二次射击"
LootTooltip="安装此武器插件后，当射击MISS时士兵有45%几率触发第二次射击."

[CritUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="激光瞄准器"
FriendlyNamePlural="激光瞄准器"
BriefSummary="+<Ability:CRITINCREASE/>%暴击率, 离目标越近时提升幅度越大。但中远程目标有命中惩罚。"
TinySummary="增加暴击率, 离目标越近时提升幅度越大。但中远程目标有命中惩罚."
LootTooltip="安装此武器插件增加暴击率, 离目标越近时提升幅度越大。但中远程目标有命中惩罚."

[CritUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级激光瞄准器"
FriendlyNamePlural="高级激光瞄准器"
BriefSummary="+<Ability:CRITINCREASE/>%暴击率, 离目标越近时提升幅度越大。但中远程目标有命中惩罚。"
TinySummary="增加暴击率, 离目标越近时提升幅度越大。但中远程目标有命中惩罚."
LootTooltip="安装此武器插件增加暴击率, 离目标越近时提升幅度越大。但中远程目标有命中惩罚."

[CritUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="终级激光瞄准器"
FriendlyNamePlural="终极激光瞄准器"
BriefSummary="+<Ability:CRITINCREASE/>%暴击率, 离目标越近时提升幅度越大。但中远程目标有命中惩罚。"
TinySummary="增加暴击率, 离目标越近时提升幅度越大。但中远程目标有命中惩罚."
LootTooltip="安装此武器插件增加暴击率, 离目标越近时提升幅度越大。但中远程目标有命中惩罚."

[MissDamageUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="枪托"
FriendlyNamePlural="枪托"
BriefSummary="反应射击时+10命中."
TinySummary="反应射击时+10命中."
LootTooltip="安装此武器插件反应射击时+10命中."

[MissDamageUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级枪托"
FriendlyNamePlural="高级枪托"
BriefSummary="反应射击时+15命中."
TinySummary="反应射击时+15命中."
LootTooltip="安装此武器插件反应射击时+15命中."

[MissDamageUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极枪托"
FriendlyNamePlural="终极枪托"
BriefSummary="反应射击时+20命中."
TinySummary="反应射击时+20命中."
LootTooltip="安装此武器插件反应射击时+20命中."

[AimUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="瞄准镜"
FriendlyNamePlural="瞄准镜"
BriefSummary="改变射程，为远程目标提供一个命中加成，但近程目标有命中惩罚。"
TinySummary="提升远程命中"
LootTooltip="安装此武器插件时为任何武器提供远程命中加成."

[AimUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级瞄准镜"
FriendlyNamePlural="高级瞄准镜"
BriefSummary="改变射程，为远程目标提供一个命中加成，但近程目标有命中惩罚。"
TinySummary="提升远程命中"
LootTooltip="安装此武器插件时为任何武器提供远程命中加成."

[AimUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="终级瞄准镜"
FriendlyNamePlural="终极瞄准镜"
BriefSummary="改变射程，为远程目标提供一个命中加成，但近程目标有命中惩罚。"
TinySummary="提升远程命中"
LootTooltip="安装此武器插件时为任何武器提供远程命中加成."

[ReloadUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="自动装填器"
FriendlyNamePlural="自动装填器"
BriefSummary="每回合自动装填1子弹，最大为4."
TinySummary="每回合自动装填1子弹，最大为4."
LootTooltip="安装此武器插件时每回合自动装填1子弹，最大为4."

[ReloadUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级自动装填器"
FriendlyNamePlural="高级自动装填器"
BriefSummary="每回合自动装填1子弹，最大为6."
TinySummary="每回合自动装填1子弹，最大为6."
LootTooltip="安装此武器插件时每回合自动装填1子弹，最大为6."

[ReloadUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极自动装填器"
FriendlyNamePlural="终极自动装填器"
BriefSummary="每回合自动装填1子弹，最大为8."
TinySummary="每回合自动装填1子弹，最大为8."
LootTooltip="安装此武器插件时每回合自动装填1子弹，最大为8."

[EleriumCoating_Bsc X2WeaponUpgradeTemplate]
FriendlyName="超铀涂层"
FriendlyNamePlural="超铀涂层"
BriefSummary="+<Ability:CRITINCREASE/>%暴击几率."
TinySummary="增加暴击率"
LootTooltip="安装此武器插件时增加暴击率."

[EleriumCoating_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级超铀涂层"
FriendlyNamePlural="高级超铀涂层"
BriefSummary="+<Ability:CRITINCREASE/>%暴击几率."
TinySummary="增加暴击率"
LootTooltip="安装此武器插件时增加暴击率."

[EleriumCoating_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极超铀涂层"
FriendlyNamePlural="终极超铀涂层"
BriefSummary="+<Ability:CRITINCREASE/>%暴击几率."
TinySummary="增加暴击率"
LootTooltip="安装此武器插件时增加暴击率."

[AlloyBlade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="合金叶片"
FriendlyNamePlural="合金叶片"
BriefSummary="+<Ability:SCOPEAIMINCREASE/>%命中."
TinySummary="增加命中"
LootTooltip="安装此武器插件时增加命中."

[AlloyBlade_Adv X2WeaponUpgradeTemplate]
FriendlyName="高级合金叶片"
FriendlyNamePlural="高级合金叶片"
BriefSummary="+<Ability:SCOPEAIMINCREASE/>%命中."
TinySummary="增加命中"
LootTooltip="安装此武器插件时增加命中."

[AlloyBlade_Sup X2WeaponUpgradeTemplate]
FriendlyName="终极合金叶片"
FriendlyNamePlural="终极合金叶片"
BriefSummary="+<Ability:SCOPEAIMINCREASE/>%命中."
TinySummary="增加命中"
LootTooltip="安装此武器插件时增加命中."
;--------------------------------------------------
;-------------------- Abilities -------------------
;--------------------------------------------------

[OpticScopeRangeModifier X2AbilityTemplate]
LocFriendlyName="视觉范围"
LocHelpText="改变一个种类的射程."

[Scope_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="瞄准镜"
LocLongDescription="使用主武器进行非反应射击时+5命中，同时也改进了该武器射程表."
LocHelpText="瞄准镜:非反应射击时+5命中"
LocFlyOverText="瞄准镜"

[Scope_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="高级瞄准镜"
LocLongDescription="使用主武器进行非反应射击时+10命中，同时也改进了该武器射程表."
LocHelpText="瞄准镜:非反应射击时+10命中"
LocFlyOverText="高级瞄准镜"

[Scope_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="终极瞄准镜"
LocLongDescription="使用主武器进行非反应射击时+15命中，同时也改进了该武器射程表."
LocHelpText="瞄准镜:非反应射击时+15命中"
LocFlyOverText="终极瞄准镜"

[AutoLoader_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="自动装填器:免费装弹"
LocLongDescription="20%几率回退装弹的1行动点."
LocHelpText="20%几率回退装弹的1行动点."
LocFlyOverText="自动装填器"

[AutoLoader_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="自动装填器:免费装弹"
LocLongDescription="40%几率回退装弹的1行动点."
LocHelpText="40%几率回退装弹的1行动点."
LocFlyOverText="自动装填器"

[AutoLoader_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="自动装填器:免费装弹"
LocLongDescription="60%几率回退装弹的1行动点."
LocHelpText="60%几率回退装弹的1行动点."
LocFlyOverText="自动装填器"

[Hair_Trigger_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="微力扳机射击"
LocHelpText="当射击MISS时，有50%几率进行第二次射击，第二次射击+10命中."

[Hair_Trigger_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="微力扳机射击"
LocHelpText="当射击MISS时，有70%几率进行第二次射击，第二次射击+15命中."

[Hair_Trigger_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="微力扳机射击"
LocHelpText="当射击MISS时，有90%几率进行第二次射击，第二次射击+20命中."

[LaserSight_EU_Bsc_Ability X2AbilityTemplate]
LocFriendlyName="激光瞄准器"

[LaserSight_EU_Adv_Ability X2AbilityTemplate]
LocFriendlyName="高级激光瞄准器"

[LaserSight_EU_Sup_Ability X2AbilityTemplate]
LocFriendlyName="终极激光瞄准器"

